alefragnani.bookmarks
asvetliakov.vscode-neovim
christian-kohler.npm-intellisense
danprince.vsnetrw
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
foxundermoon.shell-format
github.copilot
github.copilot-chat
github.github-vscode-theme
golang.go
mechatroner.rainbow-csv
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode.makefile-tools
ms-vscode.vscode-speech
pkief.material-icon-theme
ryuta46.multi-command
tobias-z.vscode-harpoon
tompollak.lazygit-vscode
tomrijndorp.find-it-faster
vspacecode.whichkey
yinfei.luahelper
